src/test/java/artillery/GetPaymentOption.yml
config:
  ensure:
    thresholds:  #A threshold check ensures that the aggregate value of a metric is under some threshold value.
      # p99 of response time must be <250:
      - "https.response_time.p99": 250
      # p95 of response time must be <100:
      - "https.response_time.p95": 100
    maxErrorRate: 1  #will make Artillery exit with a non-zero exit code if the total error rate exceeded 1%
  target: 'https://apitest.livquik.com'
  phases:
    - duration: 60
      arrivalRate: 50   #generates 50 virtual users every second for 1 minutes.
  defaults:
    headers:
      Content-Type: application/json
      Authorization: {{auth}}
      TENANT: KOTAK_BNPL
      public-key: Bearer {{public key}}
      User-Agent: PostmanRuntime/7.31.1 
scenarios:
  - name: "get payment option"
    flow:
      - post:
          url: "{{url}}"
          json:
            mobileNumber: "+912400000300"
            deviceId: "9F0D7162-F90E-41B7-8357-88891C33F0ED"
            channel: "app"
            merchantId: "uk@wad7Si"
            paymentChannelId: "kotak_bnpl_cardless_*"
            otp: "123456"
            source: "secure-2fr"
            amount: "1"
          capture:
            - json: $.statusCode
              as: statusCode
          expect:
            - statusCode: 200