src/test/java/artillery/process_pay.yml
config:
  ensure:
    thresholds:  #A threshold check ensures that the aggregate value of a metric is under some threshold value.
      # p99 of response time must be <250:
      - "https.response_time.p99": 250
      # p95 of response time must be <100:
      - "https.response_time.p95": 100
    maxErrorRate: 1  #will make Artillery exit with a non-zero exit code if the total error rate exceeded 1%
  target: '{{url}}'
  phases:
    - duration: 60
      arrivalRate: 5   #generates 5 virtual users every second for 1 minutes
  defaults:
    headers:
      x-thunder: true
      x-breeze: true
      Content-Type: "application/json"
      Authorization: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9YJVpqqoXhNK6qvn5RQbJE-GX02Zve7vcc9FUKqc0_W0"
      TENANT: "{{}}"
      public-key: "Bearer {{key}}"
      User-Agent: "PostmanRuntime/7.31.1"
scenarios:
  - name: Customers positive scenario
    weight: 2
    flow:
      - function:
          - generateFakeData
      - post:
          url: {{url}}
          json:
             mobileNumber: "7715000178"
             deviceId: "GFHGAFD6765757DFS"
             channel: "app"
             merchantId: "uk@wad7Si"
             amount: 1
             currency: "INR"
             merchantOrderId: 'JHGF7576575'
             callbackUrl: "{{url}}"
             emiSubvention: false
             emiTransaction: false
             paymentMode: {
             bnpl: [{
             paymentChannelId: "kotak_bnpl_cardless_*"
             }]
             }
             source: "secure-2fr"
          capture:
            - json: $.statusCode
              as: statusCode
            - json: $.message
              as: message
            - json: $.status
              as: status